# Docker-команда FROM вказує базовий образ контейнера
# Наш базовий образ - це Linux з попередньо встановленим python-3.10.8
FROM python:3.10.8

# Встановимо змінну середовища
ENV APP_HOME /app
ENV PYTHONPATH /app

# Встановимо робочу директорію усередині контейнера
WORKDIR $APP_HOME

# Скопіюємо інші файли до робочої директорії контейнера
COPY . .

# Встановимо залежності усередині контейнера
RUN pip install -r requirements.txt

# Позначимо порт де працює програма всередині контейнера
EXPOSE 5000

# Запустимо нашу програму всередині контейнера
ENTRYPOINT ["python", "bot_assistant/main.py"]
